CFD Projects/Serpentine_cooling/serpentine_cooling/case_Re1000/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  Serpentine Cooling Channel - epsilon (turbulent dissipation rate)
  epsilon = Cmu^0.75 * k^1.5 / L
  Cmu = 0.09, L = mixing length = 0.07 * Dh = 0.07 * 0.01333 = 9.33e-4 m
  For Re=500: k=5.32e-6
  epsilon = 0.09^0.75 * (5.32e-6)^1.5 / 9.33e-4 = 6.8e-8 m2/s3
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 6.8e-8;

boundaryField
{
    inlet
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    9.33e-4;
        value           uniform 6.8e-8;
    }

    outlet
    {
        type            zeroGradient;
    }

    hotWall
    {
        type            epsilonWallFunction;
        value           uniform 6.8e-8;
    }

    coldWall
    {
        type            epsilonWallFunction;
        value           uniform 6.8e-8;
    }

    frontAndBack
    {
        type            empty;
    }
}
