CFD Projects/Serpentine_cooling/serpentine_cooling/case_Re1000/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  Serpentine Cooling Channel - p_rgh (modified pressure = p - rho*g*h)
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 0;     // reference pressure = 0 (gauge)
    }

    hotWall
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    coldWall
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    frontAndBack
    {
        type            empty;
    }
}
