CFD Projects/Serpentine_cooling/serpentine_cooling/case_Re1000/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
  Serpentine Cooling Channel - turbulenceProperties
  Using standard k-epsilon model (appropriate for channel flow Re > 300)
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}

simulationType  RAS;

RAS
{
    RASModel        kEpsilon;   // Standard k-epsilon turbulence model
    turbulence      on;
    printCoeffs     on;
}
